// #INDEX# ======================================================================================================
// Title .........: work - Логика рабочего режима.
// Arch ..........: GD32F130C8C6, GD32F130C6C6
// Author ........: GreenBytes ( https://vk.com/greenbytes )
// Version .......: 3.5.0.0
// ==============================================================================================================

#ifndef SLAVE_H

    #define SLAVE_H

    void slave_init(void);
    void slave_loop(void);

#endif

