// #INDEX# ======================================================================================================
// Title .........: work - Логика рабочего режима.
// Arch ..........: GD32F130C8C6, GD32F130C6C6
// Author ........: GreenBytes ( https://vk.com/greenbytes )
// Version .......: 3.5.0.0
// ==============================================================================================================

#ifndef WORK_H

    #define WORK_H

    void work_init(void);
    void work_loop(void);

#endif

